# Grouping for Aggregation, Filtration, and Transformation

In [0]:
import pandas as pd
import numpy as np
pd.set_option('max_columns', 4, 'max_rows', 10, 'max_colwidth', 12)

## Introduction

### Defining an Aggregation

### How to do it...

In [0]:
flights = pd.read_csv('data/flights.csv')
flights.head()

   MONTH  DAY  ...  DIVERTED CANCELLED
0      1    1  ...         0         0
1      1    1  ...         0         0
2      1    1  ...         0         0
3      1    1  ...         0         0
4      1    1  ...         0         0

[5 rows x 14 columns]

In [0]:
(flights
     .groupby('AIRLINE')
     .agg({'ARR_DELAY':'mean'})
)

         ARR_DELAY
AIRLINE
AA        5.542661
AS       -0.833333
B6        8.692593
DL        0.339691
EV        7.034580
...            ...
OO        7.593463
UA        7.765755
US        1.681105
VX        5.348884
WN        6.397353

[14 rows x 1 columns]

In [0]:
(flights
     .groupby('AIRLINE')
     ['ARR_DELAY']
     .agg('mean')
)

AIRLINE
AA    5.542661
AS   -0.833333
B6    8.692593
DL    0.339691
EV    7.034580
        ...
OO    7.593463
UA    7.765755
US    1.681105
VX    5.348884
WN    6.397353
Name: ARR_DELAY, Length: 14, dtype: float64

In [0]:
(flights
    .groupby('AIRLINE')
    ['ARR_DELAY']
    .agg(np.mean)
)

AIRLINE
AA    5.542661
AS   -0.833333
B6    8.692593
DL    0.339691
EV    7.034580
        ...
OO    7.593463
UA    7.765755
US    1.681105
VX    5.348884
WN    6.397353
Name: ARR_DELAY, Length: 14, dtype: float64

In [0]:
(flights
    .groupby('AIRLINE')
    ['ARR_DELAY']
    .mean()
)

AIRLINE
AA    5.542661
AS   -0.833333
B6    8.692593
DL    0.339691
EV    7.034580
        ...
OO    7.593463
UA    7.765755
US    1.681105
VX    5.348884
WN    6.397353
Name: ARR_DELAY, Length: 14, dtype: float64

### How it works...

In [0]:
grouped = flights.groupby('AIRLINE')
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

### There's more...

In [0]:
(flights
   .groupby('AIRLINE')
   ['ARR_DELAY']
   .agg(np.sqrt)
)

/Users/matt/.env/364/lib/python3.6/site-packages/pandas/core/series.py:856: RuntimeWarning: invalid value encountered in sqrt
  result = getattr(ufunc, method)(*inputs, **kwargs)

Exception: Must produce aggregated value

## Grouping and aggregating with multiple columns and functions

### How to do it...

In [0]:
(flights
    .groupby(['AIRLINE', 'WEEKDAY'])
    ['CANCELLED'] 
    .agg('sum')
)

AIRLINE  WEEKDAY
AA       1          41
         2           9
         3          16
         4          20
         5          18
                    ..
WN       3          18
         4          10
         5           7
         6          10
         7           7
Name: CANCELLED, Length: 98, dtype: int64

In [0]:
(flights
    .groupby(['AIRLINE', 'WEEKDAY']) 
    ['CANCELLED', 'DIVERTED']
    .agg(['sum', 'mean'])
)

                CANCELLED           DIVERTED
                      sum      mean      sum      mean
AIRLINE WEEKDAY
AA      1              41  0.032106        6  0.004699
        2               9  0.007341        2  0.001631
        3              16  0.011949        2  0.001494
        4              20  0.015004        5  0.003751
        5              18  0.014151        1  0.000786
...                   ...       ...      ...       ...
WN      3              18  0.014118        2  0.001569
        4              10  0.007911        4  0.003165
        5               7  0.005828        0  0.000000
        6              10  0.010132        3  0.003040
        7               7  0.006066        3  0.002600

[98 rows x 4 columns]

In [0]:
(flights
    .groupby(['ORG_AIR', 'DEST_AIR'])
    .agg({'CANCELLED':['sum', 'mean', 'size'],
          'AIR_TIME':['mean', 'var']})
)

                 CANCELLED            ...    AIR_TIME
                       sum      mean  ...        mean         var
ORG_AIR DEST_AIR                      ...
ATL     ABE              0  0.000000  ...   96.387097   45.778495
        ABQ              0  0.000000  ...  170.500000   87.866667
        ABY              0  0.000000  ...   28.578947    6.590643
        ACY              0  0.000000  ...   91.333333   11.466667
        AEX              0  0.000000  ...   78.725000   47.332692
...                    ...       ...  ...         ...         ...
SFO     SNA              4  0.032787  ...   64.059322   11.338331
        STL              0  0.000000  ...  198.900000  101.042105
        SUN              0  0.000000  ...   78.000000   25.777778
        TUS              0  0.000000  ...  100.200000   35.221053
        XNA              0  0.000000  ...  173.500000    0.500000

[1130 rows x 5 columns]

In [0]:
(flights
    .groupby(['ORG_AIR', 'DEST_AIR'])
    .agg(sum_cancelled=pd.NamedAgg(column='CANCELLED', aggfunc='sum'),
         mean_cancelled=pd.NamedAgg(column='CANCELLED', aggfunc='mean'),
         size_cancelled=pd.NamedAgg(column='CANCELLED', aggfunc='size'),
         mean_air_time=pd.NamedAgg(column='AIR_TIME', aggfunc='mean'),
         var_air_time=pd.NamedAgg(column='AIR_TIME', aggfunc='var'))
)

                  sum_cancelled  mean_cancelled  ...  mean_air_time  \
ORG_AIR DEST_AIR                                 ...
ATL     ABE                 0       0.000000     ...    96.387097
        ABQ                 0       0.000000     ...   170.500000
        ABY                 0       0.000000     ...    28.578947
        ACY                 0       0.000000     ...    91.333333
        AEX                 0       0.000000     ...    78.725000
...                       ...            ...     ...          ...
SFO     SNA                 4       0.032787     ...    64.059322
        STL                 0       0.000000     ...   198.900000
        SUN                 0       0.000000     ...    78.000000
        TUS                 0       0.000000     ...   100.200000
        XNA                 0       0.000000     ...   173.500000

                  var_air_time
ORG_AIR DEST_AIR
ATL     ABE         45.778495
        ABQ         87.866667
        ABY          6.590643
        ACY         11.466667
        AEX         47.332692
...                       ...
SFO     SNA         11.338331
        STL        101.042105
        SUN         25.777778
        TUS         35.221053
        XNA          0.500000

[1130 rows x 5 columns]

### How it works...

### There's more...

In [0]:
res = (flights
    .groupby(['ORG_AIR', 'DEST_AIR'])
    .agg({'CANCELLED':['sum', 'mean', 'size'],
          'AIR_TIME':['mean', 'var']})
)
res.columns = ['_'.join(x) for x in
    res.columns.to_flat_index()]

In [0]:
res

                  CANCELLED_sum  CANCELLED_mean  ...  AIR_TIME_mean  \
ORG_AIR DEST_AIR                                 ...
ATL     ABE                 0       0.000000     ...    96.387097
        ABQ                 0       0.000000     ...   170.500000
        ABY                 0       0.000000     ...    28.578947
        ACY                 0       0.000000     ...    91.333333
        AEX                 0       0.000000     ...    78.725000
...                       ...            ...     ...          ...
SFO     SNA                 4       0.032787     ...    64.059322
        STL                 0       0.000000     ...   198.900000
        SUN                 0       0.000000     ...    78.000000
        TUS                 0       0.000000     ...   100.200000
        XNA                 0       0.000000     ...   173.500000

                  AIR_TIME_var
ORG_AIR DEST_AIR
ATL     ABE         45.778495
        ABQ         87.866667
        ABY          6.590643
        ACY         11.466667
        AEX         47.332692
...                       ...
SFO     SNA         11.338331
        STL        101.042105
        SUN         25.777778
        TUS         35.221053
        XNA          0.500000

[1130 rows x 5 columns]

In [0]:
def flatten_cols(df):
    df.columns = ['_'.join(x) for x in
        df.columns.to_flat_index()]
    return df

In [0]:
res = (flights
    .groupby(['ORG_AIR', 'DEST_AIR'])
    .agg({'CANCELLED':['sum', 'mean', 'size'],
          'AIR_TIME':['mean', 'var']})
    .pipe(flatten_cols)
)

In [0]:
res

                  CANCELLED_sum  CANCELLED_mean  ...  AIR_TIME_mean  \
ORG_AIR DEST_AIR                                 ...
ATL     ABE                 0       0.000000     ...    96.387097
        ABQ                 0       0.000000     ...   170.500000
        ABY                 0       0.000000     ...    28.578947
        ACY                 0       0.000000     ...    91.333333
        AEX                 0       0.000000     ...    78.725000
...                       ...            ...     ...          ...
SFO     SNA                 4       0.032787     ...    64.059322
        STL                 0       0.000000     ...   198.900000
        SUN                 0       0.000000     ...    78.000000
        TUS                 0       0.000000     ...   100.200000
        XNA                 0       0.000000     ...   173.500000

                  AIR_TIME_var
ORG_AIR DEST_AIR
ATL     ABE         45.778495
        ABQ         87.866667
        ABY          6.590643
        ACY         11.466667
        AEX         47.332692
...                       ...
SFO     SNA         11.338331
        STL        101.042105
        SUN         25.777778
        TUS         35.221053
        XNA          0.500000

[1130 rows x 5 columns]

In [0]:
res = (flights
    .assign(ORG_AIR=flights.ORG_AIR.astype('category'))
    .groupby(['ORG_AIR', 'DEST_AIR'])
    .agg({'CANCELLED':['sum', 'mean', 'size'],
          'AIR_TIME':['mean', 'var']})
)
res

                 CANCELLED       ...    AIR_TIME
                       sum mean  ...        mean        var
ORG_AIR DEST_AIR                 ...
ATL     ABE            0.0  0.0  ...   96.387097  45.778495
        ABI            NaN  NaN  ...         NaN        NaN
        ABQ            0.0  0.0  ...  170.500000  87.866667
        ABR            NaN  NaN  ...         NaN        NaN
        ABY            0.0  0.0  ...   28.578947   6.590643
...                    ...  ...  ...         ...        ...
SFO     TYS            NaN  NaN  ...         NaN        NaN
        VLD            NaN  NaN  ...         NaN        NaN
        VPS            NaN  NaN  ...         NaN        NaN
        XNA            0.0  0.0  ...  173.500000   0.500000
        YUM            NaN  NaN  ...         NaN        NaN

[2710 rows x 5 columns]

In [0]:
res = (flights
    .assign(ORG_AIR=flights.ORG_AIR.astype('category'))
    .groupby(['ORG_AIR', 'DEST_AIR'], observed=True)
    .agg({'CANCELLED':['sum', 'mean', 'size'],
          'AIR_TIME':['mean', 'var']})
)
res

                 CANCELLED            ...    AIR_TIME
                       sum      mean  ...        mean         var
ORG_AIR DEST_AIR                      ...
LAX     ABQ              1  0.018182  ...   89.259259   29.403215
        ANC              0  0.000000  ...  307.428571   78.952381
        ASE              1  0.038462  ...  102.920000  102.243333
        ATL              0  0.000000  ...  224.201149  127.155837
        AUS              0  0.000000  ...  150.537500   57.897310
...                    ...       ...  ...         ...         ...
MSP     TTN              1  0.125000  ...  124.428571   57.952381
        TUL              0  0.000000  ...   91.611111   63.075163
        TUS              0  0.000000  ...  176.000000   32.000000
        TVC              0  0.000000  ...   56.600000   10.300000
        XNA              0  0.000000  ...   90.642857  115.939560

[1130 rows x 5 columns]

## Removing the MultiIndex after grouping

In [0]:
flights = pd.read_csv('data/flights.csv')
airline_info = (flights
    .groupby(['AIRLINE', 'WEEKDAY'])
    .agg({'DIST':['sum', 'mean'],
          'ARR_DELAY':['min', 'max']}) 
    .astype(int)
)
airline_info

                    DIST       ARR_DELAY
                     sum  mean       min  max
AIRLINE WEEKDAY
AA      1        1455386  1139       -60  551
        2        1358256  1107       -52  725
        3        1496665  1117       -45  473
        4        1452394  1089       -46  349
        5        1427749  1122       -41  732
...                  ...   ...       ...  ...
WN      3         997213   782       -38  262
        4        1024854   810       -52  284
        5         981036   816       -44  244
        6         823946   834       -41  290
        7         945679   819       -45  261

[98 rows x 4 columns]

In [0]:
airline_info.columns.get_level_values(0)

Index(['DIST', 'DIST', 'ARR_DELAY', 'ARR_DELAY'], dtype='object')

In [0]:
airline_info.columns.get_level_values(1)

Index(['sum', 'mean', 'min', 'max'], dtype='object')

In [0]:
airline_info.columns.to_flat_index()

Index([('DIST', 'sum'), ('DIST', 'mean'), ('ARR_DELAY', 'min'),
       ('ARR_DELAY', 'max')],
      dtype='object')

In [0]:
airline_info.columns = ['_'.join(x) for x in
    airline_info.columns.to_flat_index()]

In [0]:
airline_info

                 DIST_sum  DIST_mean  ARR_DELAY_min  ARR_DELAY_max
AIRLINE WEEKDAY
AA      1         1455386       1139          -60            551
        2         1358256       1107          -52            725
        3         1496665       1117          -45            473
        4         1452394       1089          -46            349
        5         1427749       1122          -41            732
...                   ...        ...          ...            ...
WN      3          997213        782          -38            262
        4         1024854        810          -52            284
        5          981036        816          -44            244
        6          823946        834          -41            290
        7          945679        819          -45            261

[98 rows x 4 columns]

In [0]:
airline_info.reset_index()

   AIRLINE  WEEKDAY  ...  ARR_DELAY_min  ARR_DELAY_max
0       AA        1  ...          -60            551
1       AA        2  ...          -52            725
2       AA        3  ...          -45            473
3       AA        4  ...          -46            349
4       AA        5  ...          -41            732
..     ...      ...  ...          ...            ...
93      WN        3  ...          -38            262
94      WN        4  ...          -52            284
95      WN        5  ...          -44            244
96      WN        6  ...          -41            290
97      WN        7  ...          -45            261

[98 rows x 6 columns]

In [0]:
(flights
    .groupby(['AIRLINE', 'WEEKDAY'])
    .agg(dist_sum=pd.NamedAgg(column='DIST', aggfunc='sum'),
         dist_mean=pd.NamedAgg(column='DIST', aggfunc='mean'),
         arr_delay_min=pd.NamedAgg(column='ARR_DELAY', aggfunc='min'),
         arr_delay_max=pd.NamedAgg(column='ARR_DELAY', aggfunc='max'))
    .astype(int)
    .reset_index()
)

   AIRLINE  WEEKDAY  ...  arr_delay_min  arr_delay_max
0       AA        1  ...          -60            551
1       AA        2  ...          -52            725
2       AA        3  ...          -45            473
3       AA        4  ...          -46            349
4       AA        5  ...          -41            732
..     ...      ...  ...          ...            ...
93      WN        3  ...          -38            262
94      WN        4  ...          -52            284
95      WN        5  ...          -44            244
96      WN        6  ...          -41            290
97      WN        7  ...          -45            261

[98 rows x 6 columns]

### How it works...

### There's more...

In [0]:
(flights
    .groupby(['AIRLINE'], as_index=False)
    ['DIST']
    .agg('mean')
    .round(0)
)

   AIRLINE    DIST
0       AA  1114.0
1       AS  1066.0
2       B6  1772.0
3       DL   866.0
4       EV   460.0
..     ...     ...
9       OO   511.0
10      UA  1231.0
11      US  1181.0
12      VX  1240.0
13      WN   810.0

[14 rows x 2 columns]

## Grouping with a custom aggregation function

### How to do it...

In [0]:
college = pd.read_csv('data/college.csv')
(college
    .groupby('STABBR')
    ['UGDS']
    .agg(['mean', 'std'])
    .round(0)
)

          mean      std
STABBR
AK      2493.0   4052.0
AL      2790.0   4658.0
AR      1644.0   3143.0
AS      1276.0      NaN
AZ      4130.0  14894.0
...        ...      ...
VT      1513.0   2194.0
WA      2271.0   4124.0
WI      2655.0   4615.0
WV      1758.0   5957.0
WY      2244.0   2745.0

[59 rows x 2 columns]

In [0]:
def max_deviation(s):
    std_score = (s - s.mean()) / s.std()
    return std_score.abs().max()

In [0]:
(college
    .groupby('STABBR')
    ['UGDS']
    .agg(max_deviation)
    .round(1)
)

STABBR
AK    2.6
AL    5.8
AR    6.3
AS    NaN
AZ    9.9
     ...
VT    3.8
WA    6.6
WI    5.8
WV    7.2
WY    2.8
Name: UGDS, Length: 59, dtype: float64

### How it works...

### There's more...

In [0]:
(college
    .groupby('STABBR')
    ['UGDS', 'SATVRMID', 'SATMTMID']
    .agg(max_deviation)
    .round(1)
)

        UGDS  SATVRMID  SATMTMID
STABBR
AK       2.6       NaN       NaN
AL       5.8       1.6       1.8
AR       6.3       2.2       2.3
AS       NaN       NaN       NaN
AZ       9.9       1.9       1.4
...      ...       ...       ...
VT       3.8       1.9       1.9
WA       6.6       2.2       2.0
WI       5.8       2.4       2.2
WV       7.2       1.7       2.1
WY       2.8       NaN       NaN

[59 rows x 3 columns]

In [0]:
(college
    .groupby(['STABBR', 'RELAFFIL']) 
    ['UGDS', 'SATVRMID', 'SATMTMID'] 
    .agg([max_deviation, 'mean', 'std'])
    .round(1)
)

                         UGDS          ... SATMTMID
                max_deviation    mean  ...     mean   std
STABBR RELAFFIL                        ...
AK     0                 2.1   3508.9  ...      NaN   NaN
       1                 1.1    123.3  ...    503.0   NaN
AL     0                 5.2   3248.8  ...    515.8  56.7
       1                 2.4    979.7  ...    485.6  61.4
AR     0                 5.8   1793.7  ...    503.6  39.0
...                      ...      ...  ...      ...   ...
WI     0                 5.3   2879.1  ...    591.2  85.7
       1                 3.4   1716.2  ...    526.6  42.5
WV     0                 6.9   1873.9  ...    480.0  27.7
       1                 1.3    716.4  ...    484.8  17.7
WY     0                 2.8   2244.4  ...    540.0   NaN

[112 rows x 9 columns]

In [0]:
max_deviation.__name__

'max_deviation'

In [0]:
max_deviation.__name__ = 'Max Deviation'
(college
    .groupby(['STABBR', 'RELAFFIL']) 
    ['UGDS', 'SATVRMID', 'SATMTMID'] 
    .agg([max_deviation, 'mean', 'std'])
    .round(1)
)

                         UGDS          ... SATMTMID
                Max Deviation    mean  ...     mean   std
STABBR RELAFFIL                        ...
AK     0                 2.1   3508.9  ...      NaN   NaN
       1                 1.1    123.3  ...    503.0   NaN
AL     0                 5.2   3248.8  ...    515.8  56.7
       1                 2.4    979.7  ...    485.6  61.4
AR     0                 5.8   1793.7  ...    503.6  39.0
...                      ...      ...  ...      ...   ...
WI     0                 5.3   2879.1  ...    591.2  85.7
       1                 3.4   1716.2  ...    526.6  42.5
WV     0                 6.9   1873.9  ...    480.0  27.7
       1                 1.3    716.4  ...    484.8  17.7
WY     0                 2.8   2244.4  ...    540.0   NaN

[112 rows x 9 columns]

## Customizing aggregating functions with *args and **kwargs

### How to do it...

In [0]:
def pct_between_1_3k(s):
    return (s
        .between(1_000, 3_000)
        .mean()
        * 100
    )

In [0]:
(college
    .groupby(['STABBR', 'RELAFFIL'])
    ['UGDS'] 
    .agg(pct_between_1_3k)
    .round(1)
)

STABBR  RELAFFIL
AK      0           14.3
        1            0.0
AL      0           23.6
        1           33.3
AR      0           27.9
                    ...
WI      0           13.8
        1           36.0
WV      0           24.6
        1           37.5
WY      0           54.5
Name: UGDS, Length: 112, dtype: float64

In [0]:
def pct_between(s, low, high):
    return s.between(low, high).mean() * 100

In [0]:
(college
    .groupby(['STABBR', 'RELAFFIL'])
    ['UGDS'] 
    .agg(pct_between, 1_000, 10_000)
    .round(1)
)

STABBR  RELAFFIL
AK      0           42.9
        1            0.0
AL      0           45.8
        1           37.5
AR      0           39.7
                    ...
WI      0           31.0
        1           44.0
WV      0           29.2
        1           37.5
WY      0           72.7
Name: UGDS, Length: 112, dtype: float64

### How it works...

### There's more...

In [0]:
def between_n_m(n, m):
    def wrapper(ser):
        return pct_between(ser, n, m)
    wrapper.__name__ = f'between_{n}_{m}'
    return wrapper

In [0]:
(college
    .groupby(['STABBR', 'RELAFFIL'])
    ['UGDS'] 
    .agg([between_n_m(1_000, 10_000), 'max', 'mean'])
    .round(1)
)

                 between_1000_10000      max    mean
STABBR RELAFFIL
AK     0                42.9         12865.0  3508.9
       1                 0.0           275.0   123.3
AL     0                45.8         29851.0  3248.8
       1                37.5          3033.0   979.7
AR     0                39.7         21405.0  1793.7
...                      ...             ...     ...
WI     0                31.0         29302.0  2879.1
       1                44.0          8212.0  1716.2
WV     0                29.2         44924.0  1873.9
       1                37.5          1375.0   716.4
WY     0                72.7          9910.0  2244.4

[112 rows x 3 columns]

## Examining the groupby object

### How to do it...

In [0]:
college = pd.read_csv('data/college.csv')
grouped = college.groupby(['STABBR', 'RELAFFIL'])
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [0]:
print([attr for attr in dir(grouped) if not
    attr.startswith('_')])

['CITY', 'CURROPER', 'DISTANCEONLY', 'GRAD_DEBT_MDN_SUPP', 'HBCU', 'INSTNM', 'MD_EARN_WNE_P10', 'MENONLY', 'PCTFLOAN', 'PCTPELL', 'PPTUG_EF', 'RELAFFIL', 'SATMTMID', 'SATVRMID', 'STABBR', 'UG25ABV', 'UGDS', 'UGDS_2MOR', 'UGDS_AIAN', 'UGDS_ASIAN', 'UGDS_BLACK', 'UGDS_HISP', 'UGDS_NHPI', 'UGDS_NRA', 'UGDS_UNKN', 'UGDS_WHITE', 'WOMENONLY', 'agg', 'aggregate', 'all', 'any', 'apply', 'backfill', 'bfill', 'boxplot', 'corr', 'corrwith', 'count', 'cov', 'cumcount', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'dtypes', 'expanding', 'ffill', 'fillna', 'filter', 'first', 'get_group', 'groups', 'head', 'hist', 'idxmax', 'idxmin', 'indices', 'last', 'mad', 'max', 'mean', 'median', 'min', 'ndim', 'ngroup', 'ngroups', 'nth', 'nunique', 'ohlc', 'pad', 'pct_change', 'pipe', 'plot', 'prod', 'quantile', 'rank', 'resample', 'rolling', 'sem', 'shift', 'size', 'skew', 'std', 'sum', 'tail', 'take', 'transform', 'tshift', 'var']

In [0]:
grouped.ngroups

112

In [0]:
groups = list(grouped.groups)
groups[:6]

[('AK', 0), ('AK', 1), ('AL', 0), ('AL', 1), ('AR', 0), ('AR', 1)]

In [0]:
grouped.get_group(('FL', 1))

           INSTNM         CITY  ... MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
712   The Bapt...   Graceville  ...        30800           20052
713   Barry Un...        Miami  ...        44100           28250
714   Gooding ...  Panama City  ...          NaN     PrivacyS...
715   Bethune-...  Daytona ...  ...        29400           36250
724   Johnson ...    Kissimmee  ...        26300           20199
...           ...          ...  ...          ...             ...
7486  Strayer ...  Coral Sp...  ...        49200         36173.5
7487  Strayer ...  Fort Lau...  ...        49200         36173.5
7488  Strayer ...      Miramar  ...        49200         36173.5
7489  Strayer ...        Miami  ...        49200         36173.5
7490  Strayer ...        Miami  ...        49200         36173.5

[89 rows x 27 columns]

In [0]:
from IPython.display import display
for name, group in grouped:
    print(name)
    display(group.head(3))

AK

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
Universit...  Anchorage     AK  ...        42500          19449.5
Alaska Bi...     Palmer     AK  ...          NaN      PrivacyS...
Universit...  Fairbanks     AK  ...        36200            19355

[3 rows x 26 columns]

AL

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Alabama A...      Normal     AL  ...        30300            33888
Universit...  Birmingham     AL  ...        39700          21941.5
Amridge U...  Montgomery     AL  ...        40100            23370

[3 rows x 26 columns]

AR

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Universit...  Little Rock     AR  ...        33900            21736
Universit...  Little Rock     AR  ...        61400            12500
ABC Beaut...  Arkadelphia     AR  ...  PrivacyS...            16500

[3 rows x 26 columns]

AS

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
American ...  Pago Pago     AS  ...        19800      PrivacyS...

[1 rows x 26 columns]

AZ

                 CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                        ...
Everest C...  Phoenix     AZ  ...        28600             9500
Collins C...  Phoenix     AZ  ...        25700            47000
Empire Be...  Phoenix     AZ  ...        17800             9588

[3 rows x 26 columns]

CA

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Academy o...  San Fran...     CA  ...        36000            35093
ITT Techn...  Rancho C...     CA  ...        38800          25827.5
Academy o...      Oakland     CA  ...          NaN      PrivacyS...

[3 rows x 26 columns]

CO

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
The Salon...  Grand Ju...     CO  ...  PrivacyS...             9570
Adams Sta...      Alamosa     CO  ...        32800            16255
Aims Comm...      Greeley     CO  ...        31400             8773

[3 rows x 26 columns]

CT

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
Albertus ...  New Haven     CT  ...        52100          27763.5
Paul Mitc...    Danbury     CT  ...        19000            10486
Asnuntuck...    Enfield     CT  ...        30900             5500

[3 rows x 26 columns]

DC

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
American ...  Washington     DC  ...        55900            24589
Catholic ...  Washington     DC  ...        53900            26000
Universit...  Washington     DC  ...        34800          22393.5

[3 rows x 26 columns]

DE

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Margaret ...       Lewes     DE  ...  PrivacyS...      PrivacyS...
Dawn Care...  Wilmington     DE  ...        22400             9500
Delaware ...  Georgetown     DE  ...        28800             6750

[3 rows x 26 columns]

FL

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Wyotech-D...  Ormond B...     FL  ...        31800            11600
The Art I...  Fort Lau...     FL  ...        28800            29983
Atlantic ...  Coconut ...     FL  ...        31900      PrivacyS...

[3 rows x 26 columns]

FM

                 CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                        ...
College o...  Pohnpei     FM  ...        15700      PrivacyS...

[1 rows x 26 columns]

GA

                  CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                         ...
Luther Ri...  Lithonia     GA  ...        39400            29500
Abraham B...    Tifton     GA  ...        32000          15085.5
Agnes Sco...   Decatur     GA  ...        38800            27000

[3 rows x 26 columns]

GU

                  CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                         ...
Guam Comm...  Mangilao     GU  ...        22000      PrivacyS...
Universit...  Mangilao     GU  ...        29900      PrivacyS...
Pacific I...  Mangilao     GU  ...  PrivacyS...      PrivacyS...

[3 rows x 26 columns]

HI

                  CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                         ...
Heald Col...  Honolulu     HI  ...        35000            11676
Chaminade...  Honolulu     HI  ...        38400            22000
Universit...      Hilo     HI  ...        33500            19197

[3 rows x 26 columns]

IA

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Allen Col...    Waterloo     IA  ...        49100          17090.5
AIB Colle...  Des Moines     IA  ...        37000          19732.5
Briar Cli...  Sioux City     IA  ...        38100            24000

[3 rows x 26 columns]

ID

               CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                      ...
Carringto...  Boise     ID  ...        25000             9500
Boise Bib...  Boise     ID  ...        25500            19596
Boise Sta...  Boise     ID  ...        35600            23500

[3 rows x 26 columns]

IL

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Prince In...     Elmhurst     IL  ...  PrivacyS...            20992
Adler Uni...      Chicago     IL  ...          NaN      PrivacyS...
Alvareita...  Edwardsv...     IL  ...  PrivacyS...             9911

[3 rows x 26 columns]

IN

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
Bethany T...   Richmond     IN  ...          NaN      PrivacyS...
Ancilla C...  Donaldson     IN  ...        29400            17000
Anderson ...   Anderson     IN  ...        35600            27000

[3 rows x 26 columns]

KS

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Allen Cou...         Iola     KS  ...        29100             6900
Baker Uni...  Baldwin ...     KS  ...        48800            25250
Barton Co...   Great Bend     KS  ...        32200             8976

[3 rows x 26 columns]

KY

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Alice Llo...  Pippa Pa...     KY  ...        33500            16495
Asbury Un...      Wilmore     KY  ...        33600            25250
Asbury Th...      Wilmore     KY  ...        42500      PrivacyS...

[3 rows x 26 columns]

LA

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Central L...  Alexandria     LA  ...  PrivacyS...      PrivacyS...
American ...  Shreveport     LA  ...        19400             9500
Ayers Car...  Shreveport     LA  ...        25100             9500

[3 rows x 26 columns]

MA

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Hult Inte...    Cambridge     MA  ...          NaN      PrivacyS...
New Engla...       Boston     MA  ...          NaN            18450
American ...  Springfield     MA  ...        38900            27000

[3 rows x 26 columns]

MD

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Aaron's A...      Waldorf     MD  ...  PrivacyS...      PrivacyS...
Aesthetic...  Gaithers...     MD  ...  PrivacyS...             6333
Allegany ...   Cumberland     MD  ...        29300            14072

[3 rows x 26 columns]

ME

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Kaplan Un...  S Portland     ME  ...        33400            29493
College o...  Bar Harbor     ME  ...        26400            19000
Bates Col...    Lewiston     ME  ...        51600            16297

[3 rows x 26 columns]

MH

                CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                       ...
College o...  Majuro     MH  ...  PrivacyS...      PrivacyS...

[1 rows x 26 columns]

MI

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
West Mich...  Kalamazoo     MI  ...        14800      PrivacyS...
Adrian Co...     Adrian     MI  ...        37100            27000
Albion Co...     Albion     MI  ...        44900            27000

[3 rows x 26 columns]

MN

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Walden Un...  Minneapolis     MN  ...        59700            29125
Academy C...  Bloomington     MN  ...        38500            29069
Alexandri...   Alexandria     MN  ...        35100            12000

[3 rows x 26 columns]

MO

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Concorde ...  Kansas City     MO  ...        22100             9500
Aquinas I...  Saint Louis     MO  ...          NaN      PrivacyS...
Assemblie...  Springfield     MO  ...  PrivacyS...            22062

[3 rows x 26 columns]

MP

                CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                       ...
Northern ...  Saipan     MP  ...        19600      PrivacyS...

[1 rows x 26 columns]

MS

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Alcorn St...  Alcorn S...     MS  ...        30400            28000
Belhaven ...      Jackson     MS  ...        36800            29656
Blue Moun...  Blue Mou...     MS  ...        29200      PrivacyS...

[3 rows x 26 columns]

MT

                  CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                         ...
Academy o...   Bozeman     MT  ...  PrivacyS...      PrivacyS...
Blackfeet...  Browning     MT  ...        15600      PrivacyS...
Butte Aca...     Butte     MT  ...  PrivacyS...             9500

[3 rows x 26 columns]

NC

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
College o...  Elizabet...     NC  ...        22300      PrivacyS...
The Art I...    Charlotte     NC  ...        28800            25167
South Pie...      Polkton     NC  ...        21700      PrivacyS...

[3 rows x 26 columns]

ND

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
Rasmussen...      Fargo     ND  ...        30900            21163
Bismarck ...   Bismarck     ND  ...        38400            11588
Dickinson...  Dickinson     ND  ...        38800            19500

[3 rows x 26 columns]

NE

                  CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                         ...
La'James ...   Fremont     NE  ...        15900      PrivacyS...
Bellevue ...  Bellevue     NE  ...        52600            17188
Clarkson ...     Omaha     NE  ...        47000            26000

[3 rows x 26 columns]

NH

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Colby-Saw...  New London     NH  ...        38800            27000
Continent...      Hudson     NH  ...        23200             9075
Daniel We...      Nashua     NH  ...        50500            26999

[3 rows x 26 columns]

NJ

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Eastwick ...   Hackensack     NJ  ...        27300            12519
Atlantic ...  Mays Lan...     NJ  ...        28100            10005
Fortis In...        Wayne     NJ  ...        30400            10305

[3 rows x 26 columns]

NM

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Pima Medi...  Albuquerque     NM  ...        28200             8708
Olympian ...   Alamogordo     NM  ...        17200            11705
Central N...  Albuquerque     NM  ...        29500            10000

[3 rows x 26 columns]

NV

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
Academy o...  Las Vegas     NV  ...        17200             9500
Career Co...     Sparks     NV  ...        23800          14020.5
College o...  Las Vegas     NV  ...        31700            10500

[3 rows x 26 columns]

NY

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Tri-State...     New York     NY  ...  PrivacyS...      PrivacyS...
Vaughn Co...     Flushing     NY  ...        48700            22625
Adelphi U...  Garden City     NY  ...        51300            25000

[3 rows x 26 columns]

OH

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
ETI Techn...        Niles     OH  ...        22700            13964
The Art I...   Cincinnati     OH  ...        29700      PrivacyS...
Miami-Jac...  Independ...     OH  ...        26700            22940

[3 rows x 26 columns]

OK

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
American ...  Oklahoma...     OK  ...        27300             7023
Bacone Co...     Muskogee     OK  ...        29700            26350
Oklahoma ...  Bartlesv...     OK  ...        46100          21276.5

[3 rows x 26 columns]

OR

                  CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                         ...
Academy o...     Salem     OR  ...        14800            18519
Abdill Ca...   Medford     OR  ...  PrivacyS...             9500
Paul Mitc...  Portland     OR  ...          NaN            10194

[3 rows x 26 columns]

PA

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Abington ...  Willow G...     PA  ...        63300            15836
Jolie Hai...     Hazleton     PA  ...  PrivacyS...           8847.5
Keystone ...   Harrisburg     PA  ...        24400          11677.5

[3 rows x 26 columns]

PR

                 CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                        ...
Institute...  Arecibo     PR  ...        12000      PrivacyS...
Education...  Bayamon     PR  ...        14500      PrivacyS...
American ...  Bayamon     PR  ...        19300             3920

[3 rows x 26 columns]

PW

               CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                      ...
Palau Com...  Koror     PW  ...        24700      PrivacyS...

[1 rows x 26 columns]

RI

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Empire Be...  Providence     RI  ...        21000             9833
Brown Uni...  Providence     RI  ...        59700            15500
Bryant Un...  Smithfield     RI  ...        64500            27000

[3 rows x 26 columns]

SC

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Aiken Tec...  Granitev...     SC  ...        24500             9625
Allen Uni...     Columbia     SC  ...        21100            37676
Charlesto...   Charleston     SC  ...        35700            27741

[3 rows x 26 columns]

SD

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Augustana...  Sioux Falls     SD  ...        41800            27000
Black Hil...   Rapid City     SD  ...        16200            11790
Black Hil...    Spearfish     SD  ...        34400            25625

[3 rows x 26 columns]

TN

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
ITT Techn...  Nashville     TN  ...        38800          25827.5
American ...  Nashville     TN  ...  PrivacyS...            25000
Arnolds B...      Milan     TN  ...        16000      PrivacyS...

[3 rows x 26 columns]

TX

                  CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                         ...
Abilene C...   Abilene     TX  ...        40200            25985
Alvin Com...     Alvin     TX  ...        34500             6750
Amarillo ...  Amarillo     TX  ...        31700            10950

[3 rows x 26 columns]

UT

               CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                      ...
AmeriTech...  Provo     UT  ...        24700            24370
Bridgerla...  Logan     UT  ...        24300      PrivacyS...
Brigham Y...  Provo     UT  ...        57200            11000

[3 rows x 26 columns]

VA

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Medtech I...  Falls Ch...     VA  ...        26300             9236
Bar Palma...      Roanoke     VA  ...        16900             9731
Advanced ...  Virginia...     VA  ...        38000            16279

[3 rows x 26 columns]

VI

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Universit...  Charlott...     VI  ...        31800            15150
Universit...    St. Croix     VI  ...        31800            15150

[2 rows x 26 columns]

VT

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Benningto...  Bennington     VT  ...        24600            27000
Burlingto...  Burlington     VT  ...        26000            25000
Castleton...   Castleton     VT  ...        34900            25000

[3 rows x 26 columns]

WA

                   CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                          ...
Beauty Ac...  Wenatchee     WA  ...  PrivacyS...           8718.5
The Art I...    Seattle     WA  ...        34100          25937.5
Evergreen...   Bellevue     WA  ...  PrivacyS...             7917

[3 rows x 26 columns]

WI

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Advanced ...    Glendale     WI  ...        24000            10314
VICI Aved...  Greenfield     WI  ...        24000            10314
Alverno C...   Milwaukee     WI  ...        37100          32606.5

[3 rows x 26 columns]

WV

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Scott Col...    Wheeling     WV  ...        14800             9250
Alderson ...    Philippi     WV  ...        46000            27000
Appalachi...  Mount Hope     WV  ...        28700             9300

[3 rows x 26 columns]

WY

                    CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                           ...
Casper Co...      Casper     WY  ...        34800            10764
Central W...    Riverton     WY  ...        25200             8757
Eastern W...  Torrington     WY  ...        25900            10000

[3 rows x 26 columns]

In [0]:
for name, group in grouped:
    print(name)
    print(group)
    break

('AK', 0)
           INSTNM       CITY  ... MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
60    Universi...  Anchorage  ...        42500         19449.5
62    Universi...  Fairbanks  ...        36200           19355
63    Universi...     Juneau  ...        37400           16875
65    AVTEC-Al...     Seward  ...        33500     PrivacyS...
66    Charter ...  Anchorage  ...        39200           13875
67    Alaska C...  Anchorage  ...        28700            8994
5171  Ilisagvi...     Barrow  ...        24900     PrivacyS...

[7 rows x 27 columns]

In [0]:
grouped.head(2)

           INSTNM        CITY  ... MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
0     Alabama ...      Normal  ...        30300           33888
1     Universi...  Birmingham  ...        39700         21941.5
2     Amridge ...  Montgomery  ...        40100           23370
10    Birmingh...  Birmingham  ...        44200           27000
43    Prince I...    Elmhurst  ...  PrivacyS...           20992
...           ...         ...  ...          ...             ...
5289  Pacific ...    Mangilao  ...  PrivacyS...     PrivacyS...
6439  Touro Un...   Henderson  ...          NaN     PrivacyS...
7352  Marinell...   Henderson  ...        21200          9796.5
7404  Universi...   St. Croix  ...        31800           15150
7419  Computer...  Las Cruces  ...        21300           14250

[215 rows x 27 columns]

### How it works...

### There's more...

In [0]:
grouped.nth([1, -1])

                      INSTNM         CITY  ...  MD_EARN_WNE_P10  \
STABBR RELAFFIL                            ...
AK     0         Universi...    Fairbanks  ...        36200
       0         Ilisagvi...       Barrow  ...        24900
       1         Alaska P...    Anchorage  ...        47000
       1         Alaska C...     Soldotna  ...          NaN
AL     0         Universi...   Birmingham  ...        39700
...                      ...          ...  ...          ...
WV     0         BridgeVa...  South  C...  ...          NaN
       1         Appalach...   Mount Hope  ...        28700
       1         West Vir...  Nutter Fort  ...        16700
WY     0         Central ...     Riverton  ...        25200
       0         CollegeA...     Cheyenne  ...        25600

                 GRAD_DEBT_MDN_SUPP
STABBR RELAFFIL
AK     0               19355
       0         PrivacyS...
       1               23250
       1         PrivacyS...
AL     0             21941.5
...                      ...
WV     0              9429.5
       1                9300
       1               19258
WY     0                8757
       0             27235.5

[213 rows x 25 columns]

## Filtering for states with a minority majority

### How to do it...

In [0]:
college = pd.read_csv('data/college.csv', index_col='INSTNM')
grouped = college.groupby('STABBR')
grouped.ngroups

59

In [0]:
college['STABBR'].nunique() # verifying the same number

59

In [0]:
def check_minority(df, threshold):
    minority_pct = 1 - df['UGDS_WHITE']
    total_minority = (df['UGDS'] * minority_pct).sum()
    total_ugds = df['UGDS'].sum()
    total_minority_pct = total_minority / total_ugds
    return total_minority_pct > threshold

In [0]:
college_filtered = grouped.filter(check_minority, threshold=.5)
college_filtered

                     CITY STABBR  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
INSTNM                            ...
Everest C...      Phoenix     AZ  ...        28600             9500
Collins C...      Phoenix     AZ  ...        25700            47000
Empire Be...      Phoenix     AZ  ...        17800             9588
Empire Be...       Tucson     AZ  ...        18200             9833
Thunderbi...     Glendale     AZ  ...       118900      PrivacyS...
...                   ...    ...  ...          ...              ...
WestMed C...       Merced     CA  ...          NaN          15623.5
Vantage C...      El Paso     TX  ...          NaN             9500
SAE Insti...   Emeryville     CA  ...          NaN             9500
Bay Area ...     San Jose     CA  ...          NaN      PrivacyS...
Excel Lea...  San Antonio     TX  ...          NaN            12125

[3028 rows x 26 columns]

In [0]:
college.shape

(7535, 26)

In [0]:
college_filtered.shape

(3028, 26)

In [0]:
college_filtered['STABBR'].nunique()

20

### How it works...

### There's more...

In [0]:
college_filtered_20 = grouped.filter(check_minority, threshold=.2)
college_filtered_20.shape

(7461, 26)

In [0]:
college_filtered_20['STABBR'].nunique()

57

In [0]:
college_filtered_70 = grouped.filter(check_minority, threshold=.7)
college_filtered_70.shape

(957, 26)

In [0]:
college_filtered_70['STABBR'].nunique()

10

## Transforming through a weight loss bet

### How to do it...

In [0]:
weight_loss = pd.read_csv('data/weight_loss.csv')
weight_loss.query('Month == "Jan"')

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197
2  Bob   Jan  Week 2     288
3  Amy   Jan  Week 2     189
4  Bob   Jan  Week 3     283
5  Amy   Jan  Week 3     189
6  Bob   Jan  Week 4     283
7  Amy   Jan  Week 4     190

In [0]:
def percent_loss(s):
    return ((s - s.iloc[0]) / s.iloc[0]) * 100

In [0]:
(weight_loss
    .query('Name=="Bob" and Month=="Jan"')
    ['Weight']
    .pipe(percent_loss)
)

0    0.000000
2   -1.030928
4   -2.749141
6   -2.749141
Name: Weight, dtype: float64

In [0]:
(weight_loss
    .groupby(['Name', 'Month'])
    ['Weight'] 
    .transform(percent_loss)
)

0     0.000000
1     0.000000
2    -1.030928
3    -4.060914
4    -2.749141
        ...
27   -3.529412
28   -3.065134
29   -3.529412
30   -4.214559
31   -5.294118
Name: Weight, Length: 32, dtype: float64

In [0]:
(weight_loss
    .assign(percent_loss=(weight_loss
        .groupby(['Name', 'Month'])
        ['Weight'] 
        .transform(percent_loss)
        .round(1)))
    .query('Name=="Bob" and Month in ["Jan", "Feb"]')
)

   Name Month  ... Weight  percent_loss
0   Bob   Jan  ...    291          0.0
2   Bob   Jan  ...    288         -1.0
4   Bob   Jan  ...    283         -2.7
6   Bob   Jan  ...    283         -2.7
8   Bob   Feb  ...    283          0.0
10  Bob   Feb  ...    275         -2.8
12  Bob   Feb  ...    268         -5.3
14  Bob   Feb  ...    268         -5.3

[8 rows x 5 columns]

In [0]:
(weight_loss
    .assign(percent_loss=(weight_loss
        .groupby(['Name', 'Month'])
        ['Weight'] 
        .transform(percent_loss)
        .round(1)))
    .query('Week == "Week 4"')
)

   Name Month  ... Weight  percent_loss
6   Bob   Jan  ...    283         -2.7
7   Amy   Jan  ...    190         -3.6
14  Bob   Feb  ...    268         -5.3
15  Amy   Feb  ...    173         -8.9
22  Bob   Mar  ...    261         -2.6
23  Amy   Mar  ...    170         -1.7
30  Bob   Apr  ...    250         -4.2
31  Amy   Apr  ...    161         -5.3

[8 rows x 5 columns]

In [0]:
(weight_loss
    .assign(percent_loss=(weight_loss
        .groupby(['Name', 'Month'])
        ['Weight'] 
        .transform(percent_loss)
        .round(1)))
    .query('Week == "Week 4"')
    .pivot(index='Month', columns='Name',
           values='percent_loss')
)

Name   Amy  Bob
Month
Apr   -5.3 -4.2
Feb   -8.9 -5.3
Jan   -3.6 -2.7
Mar   -1.7 -2.6

In [0]:
(weight_loss
    .assign(percent_loss=(weight_loss
        .groupby(['Name', 'Month'])
        ['Weight'] 
        .transform(percent_loss)
        .round(1)))
    .query('Week == "Week 4"')
    .pivot(index='Month', columns='Name',
           values='percent_loss')
    .assign(winner=lambda df_:
            np.where(df_.Amy < df_.Bob, 'Amy', 'Bob'))
)

Name   Amy  Bob winner
Month
Apr   -5.3 -4.2    Amy
Feb   -8.9 -5.3    Amy
Jan   -3.6 -2.7    Amy
Mar   -1.7 -2.6    Bob

In [0]:
(weight_loss
    .assign(percent_loss=(weight_loss
        .groupby(['Name', 'Month'])
        ['Weight'] 
        .transform(percent_loss)
        .round(1)))
    .query('Week == "Week 4"')
    .pivot(index='Month', columns='Name',
           values='percent_loss')
    .assign(winner=lambda df_:
            np.where(df_.Amy < df_.Bob, 'Amy', 'Bob'))
    .style.highlight_min(axis=1)
)

In [0]:
(weight_loss
    .assign(percent_loss=(weight_loss
        .groupby(['Name', 'Month'])
        ['Weight'] 
        .transform(percent_loss)
        .round(1)))
    .query('Week == "Week 4"')
    .pivot(index='Month', columns='Name',
           values='percent_loss')
    .assign(winner=lambda df_:
            np.where(df_.Amy < df_.Bob, 'Amy', 'Bob'))
    .winner
    .value_counts()
)

Amy    3
Bob    1
Name: winner, dtype: int64

### How it works...

In [0]:
(weight_loss
    .assign(percent_loss=(weight_loss
        .groupby(['Name', 'Month'])
        ['Weight'] 
        .transform(percent_loss)
        .round(1)))
    .query('Week == "Week 4"')
    .groupby(['Month', 'Name'])
    ['percent_loss']
    .first()
    .unstack()
)

Name   Amy  Bob
Month
Apr   -5.3 -4.2
Feb   -8.9 -5.3
Jan   -3.6 -2.7
Mar   -1.7 -2.6

### There's more...

In [0]:
(weight_loss
    .assign(percent_loss=(weight_loss
        .groupby(['Name', 'Month'])
        ['Weight'] 
        .transform(percent_loss)
        .round(1)),
            Month=pd.Categorical(weight_loss.Month,
                  categories=['Jan', 'Feb', 'Mar', 'Apr'],
                  ordered=True))
    .query('Week == "Week 4"')
    .pivot(index='Month', columns='Name',
           values='percent_loss')
)

Name   Amy  Bob
Month
Jan   -3.6 -2.7
Feb   -8.9 -5.3
Mar   -1.7 -2.6
Apr   -5.3 -4.2

## Calculating weighted mean SAT scores per state with apply

### How to do it...

In [0]:
college = pd.read_csv('data/college.csv')
subset = ['UGDS', 'SATMTMID', 'SATVRMID']
college2 = college.dropna(subset=subset)
college.shape

(7535, 27)

In [0]:
college2.shape

(1184, 27)

In [0]:
def weighted_math_average(df):
    weighted_math = df['UGDS'] * df['SATMTMID']
    return int(weighted_math.sum() / df['UGDS'].sum())

In [0]:
college2.groupby('STABBR').apply(weighted_math_average)

STABBR
AK    503
AL    536
AR    529
AZ    569
CA    564
     ...
VT    566
WA    555
WI    593
WV    500
WY    540
Length: 53, dtype: int64

In [0]:
(college2
    .groupby('STABBR')
    .agg(weighted_math_average)
)

        INSTNM  CITY  ...  MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
STABBR                ...
AK         503   503  ...          503              503
AL         536   536  ...          536              536
AR         529   529  ...          529              529
AZ         569   569  ...          569              569
CA         564   564  ...          564              564
...        ...   ...  ...          ...              ...
VT         566   566  ...          566              566
WA         555   555  ...          555              555
WI         593   593  ...          593              593
WV         500   500  ...          500              500
WY         540   540  ...          540              540

[53 rows x 26 columns]

In [0]:
(college2
    .groupby('STABBR')
    ['SATMTMID'] 
    .agg(weighted_math_average)
)

KeyError: 'UGDS'

In [0]:
def weighted_average(df):
   weight_m = df['UGDS'] * df['SATMTMID']
   weight_v = df['UGDS'] * df['SATVRMID']
   wm_avg = weight_m.sum() / df['UGDS'].sum()
   wv_avg = weight_v.sum() / df['UGDS'].sum()
   data = {'w_math_avg': wm_avg,
           'w_verbal_avg': wv_avg,
           'math_avg': df['SATMTMID'].mean(),
           'verbal_avg': df['SATVRMID'].mean(),
           'count': len(df)
   }
   return pd.Series(data)
(college2
    .groupby('STABBR')
    .apply(weighted_average)
    .astype(int)
)

        w_math_avg  w_verbal_avg  ...  verbal_avg  count
STABBR                            ...
AK             503          555   ...         555      1
AL             536          533   ...         508     21
AR             529          504   ...         491     16
AZ             569          557   ...         538      6
CA             564          539   ...         549     72
...            ...          ...   ...         ...    ...
VT             566          564   ...         527      8
WA             555          541   ...         548     18
WI             593          556   ...         516     14
WV             500          487   ...         473     17
WY             540          535   ...         535      1

[53 rows x 5 columns]

### How it works...

In [0]:
(college
    .groupby('STABBR')
    .apply(weighted_average)
)

        w_math_avg  w_verbal_avg  ...  verbal_avg  count
STABBR                            ...
AK        5.548091     6.121651   ...  555.000000   10.0
AL      261.895658   260.550109   ...  508.476190   96.0
AR      301.054792   287.264872   ...  491.875000   86.0
AS        0.000000     0.000000   ...         NaN    1.0
AZ       61.815821    60.511712   ...  538.333333  133.0
...            ...          ...   ...         ...    ...
VT      389.967094   388.696848   ...  527.500000   27.0
WA      274.885878   267.880280   ...  548.333333  123.0
WI      153.803086   144.160115   ...  516.857143  112.0
WV      224.697582   218.843452   ...  473.411765   73.0
WY      216.761180   214.754132   ...  535.000000   11.0

[59 rows x 5 columns]

### There's more...

In [0]:
from scipy.stats import gmean, hmean
def calculate_means(df):
    df_means = pd.DataFrame(index=['Arithmetic', 'Weighted',
                                   'Geometric', 'Harmonic'])
    cols = ['SATMTMID', 'SATVRMID']
    for col in cols:
        arithmetic = df[col].mean()
        weighted = np.average(df[col], weights=df['UGDS'])
        geometric = gmean(df[col])
        harmonic = hmean(df[col])
        df_means[col] = [arithmetic, weighted,
                         geometric, harmonic]
    df_means['count'] = len(df)
    return df_means.astype(int)
(college2
    .groupby('STABBR')
    .apply(calculate_means)
)

                   SATMTMID  SATVRMID  count
STABBR
AK     Arithmetic       503       555      1
       Weighted         503       555      1
       Geometric        503       555      1
       Harmonic         503       555      1
AL     Arithmetic       504       508     21
...                     ...       ...    ...
WV     Harmonic         480       472     17
WY     Arithmetic       540       535      1
       Weighted         540       535      1
       Geometric        540       534      1
       Harmonic         540       535      1

[212 rows x 3 columns]

## Grouping by continuous variables

### How to do it...

In [0]:
flights = pd.read_csv('data/flights.csv')
flights

       MONTH  DAY  ...  DIVERTED CANCELLED
0          1    1  ...         0         0
1          1    1  ...         0         0
2          1    1  ...         0         0
3          1    1  ...         0         0
4          1    1  ...         0         0
...      ...  ...  ...       ...       ...
58487     12   31  ...         0         0
58488     12   31  ...         0         0
58489     12   31  ...         0         0
58490     12   31  ...         0         0
58491     12   31  ...         0         0

[58492 rows x 14 columns]

In [0]:
bins = [-np.inf, 200, 500, 1000, 2000, np.inf]
cuts = pd.cut(flights['DIST'], bins=bins)
cuts

0        (500.0, ...
1        (1000.0,...
2        (500.0, ...
3        (1000.0,...
4        (1000.0,...
            ...
58487    (1000.0,...
58488    (200.0, ...
58489    (200.0, ...
58490    (500.0, ...
58491    (500.0, ...
Name: DIST, Length: 58492, dtype: category
Categories (5, interval[float64]): [(-inf, 2... < (200.0, ... < (500.0, ... < (1000.0,... < (2000.0,...]

In [0]:
cuts.value_counts()

(500.0, 1000.0]     20659
(200.0, 500.0]      15874
(1000.0, 2000.0]    14186
(2000.0, inf]        4054
(-inf, 200.0]        3719
Name: DIST, dtype: int64

In [0]:
(flights
    .groupby(cuts)
    ['AIRLINE']
    .value_counts(normalize=True) 
    .round(3)
)

DIST           AIRLINE
(-inf, 200.0]  OO         0.326
               EV         0.289
               MQ         0.211
               DL         0.086
               AA         0.052
                          ...
(2000.0, inf]  WN         0.046
               HA         0.028
               NK         0.019
               AS         0.012
               F9         0.004
Name: AIRLINE, Length: 57, dtype: float64

### How it works...

### There's more...

In [0]:
(flights
  .groupby(cuts)
  ['AIR_TIME']
  .quantile(q=[.25, .5, .75]) 
  .div(60)
  .round(2)
)

DIST
(-inf, 200.0]     0.25    0.43
                  0.50    0.50
                  0.75    0.57
(200.0, 500.0]    0.25    0.77
                  0.50    0.92
                          ...
(1000.0, 2000.0]  0.50    2.93
                  0.75    3.40
(2000.0, inf]     0.25    4.30
                  0.50    4.70
                  0.75    5.03
Name: AIR_TIME, Length: 15, dtype: float64

In [0]:
labels=['Under an Hour', '1 Hour', '1-2 Hours',
        '2-4 Hours', '4+ Hours']
cuts2 = pd.cut(flights['DIST'], bins=bins, labels=labels)
(flights
   .groupby(cuts2)
   ['AIRLINE']
   .value_counts(normalize=True) 
   .round(3) 
   .unstack() 
)

AIRLINE          AA     AS  ...     VX     WN
DIST                        ...
Under an ...  0.052    NaN  ...    NaN  0.009
1 Hour        0.071  0.001  ...  0.028  0.194
1-2 Hours     0.144  0.023  ...  0.004  0.138
2-4 Hours     0.264  0.016  ...  0.012  0.160
4+ Hours      0.212  0.012  ...  0.074  0.046

[5 rows x 14 columns]

## Counting the total number of flights between cities

### How to do it...

In [0]:
flights = pd.read_csv('data/flights.csv')
flights_ct = flights.groupby(['ORG_AIR', 'DEST_AIR']).size()
flights_ct

ORG_AIR  DEST_AIR
ATL      ABE          31
         ABQ          16
         ABY          19
         ACY           6
         AEX          40
                    ...
SFO      SNA         122
         STL          20
         SUN          10
         TUS          20
         XNA           2
Length: 1130, dtype: int64

In [0]:
flights_ct.loc[[('ATL', 'IAH'), ('IAH', 'ATL')]]

ORG_AIR  DEST_AIR
ATL      IAH         121
IAH      ATL         148
dtype: int64

In [0]:
f_part3 = (flights  # doctest: +SKIP
  [['ORG_AIR', 'DEST_AIR']] 
  .apply(lambda ser:
         ser.sort_values().reset_index(drop=True),
         axis='columns')
)
f_part3

         0    1
0      LAX  SLC
1      DEN  IAD
2      DFW  VPS
3      DCA  DFW
4      LAX  MCI
...    ...  ...
58487  DFW  SFO
58488  LAS  SFO
58489  SBA  SFO
58490  ATL  MSP
58491  BOI  SFO

[58492 rows x 2 columns]

In [0]:
rename_dict = {0:'AIR1', 1:'AIR2'}  
(flights     # doctest: +SKIP
  [['ORG_AIR', 'DEST_AIR']]
  .apply(lambda ser:
         ser.sort_values().reset_index(drop=True),
         axis='columns')
  .rename(columns=rename_dict)
  .groupby(['AIR1', 'AIR2'])
  .size()
)

AIR1  AIR2
ABE   ATL      31
      ORD      24
ABI   DFW      74
ABQ   ATL      16
      DEN      46
             ...
SFO   SNA     122
      STL      20
      SUN      10
      TUS      20
      XNA       2
Length: 1085, dtype: int64

In [0]:
(flights     # doctest: +SKIP
  [['ORG_AIR', 'DEST_AIR']]
  .apply(lambda ser:
         ser.sort_values().reset_index(drop=True),
         axis='columns')
  .rename(columns=rename_dict)
  .groupby(['AIR1', 'AIR2'])
  .size()
  .loc[('ATL', 'IAH')]
)

269

In [0]:
(flights     # doctest: +SKIP
  [['ORG_AIR', 'DEST_AIR']]
  .apply(lambda ser:
         ser.sort_values().reset_index(drop=True),
         axis='columns')
  .rename(columns=rename_dict)
  .groupby(['AIR1', 'AIR2'])
  .size()
  .loc[('IAH', 'ATL')]
)

KeyError: ('IAH', 'ATL')

### How it works...

### There's more ...

In [0]:
data_sorted = np.sort(flights[['ORG_AIR', 'DEST_AIR']])
data_sorted[:10]

array([['LAX', 'SLC'],
       ['DEN', 'IAD'],
       ['DFW', 'VPS'],
       ['DCA', 'DFW'],
       ['LAX', 'MCI'],
       ['IAH', 'SAN'],
       ['DFW', 'MSY'],
       ['PHX', 'SFO'],
       ['ORD', 'STL'],
       ['IAH', 'SJC']], dtype=object)

In [0]:
flights_sort2 = pd.DataFrame(data_sorted, columns=['AIR1', 'AIR2'])
flights_sort2.equals(f_part3.rename(columns={0:'AIR1',
    1:'AIR2'}))

False

%%timeit
flights_sort = (flights   # doctest: +SKIP
    [['ORG_AIR', 'DEST_AIR']] 
   .apply(lambda ser:
         ser.sort_values().reset_index(drop=True),
         axis='columns')
)

In [0]:
%%timeit
data_sorted = np.sort(flights[['ORG_AIR', 'DEST_AIR']])
flights_sort2 = pd.DataFrame(data_sorted,
    columns=['AIR1', 'AIR2'])

## Finding the longest streak of on-time flights

### How to do it...

In [0]:
s = pd.Series([0, 1, 1, 0, 1, 1, 1, 0])
s

0    0
1    1
2    1
3    0
4    1
5    1
6    1
7    0
dtype: int64

In [0]:
s1 = s.cumsum()
s1

0    0
1    1
2    2
3    2
4    3
5    4
6    5
7    5
dtype: int64

In [0]:
s.mul(s1)

0    0
1    1
2    2
3    0
4    3
5    4
6    5
7    0
dtype: int64

In [0]:
s.mul(s1).diff()

0    NaN
1    1.0
2    1.0
3   -2.0
4    3.0
5    1.0
6    1.0
7   -5.0
dtype: float64

In [0]:
(s
    .mul(s.cumsum())
    .diff()
    .where(lambda x: x < 0)
)

0    NaN
1    NaN
2    NaN
3   -2.0
4    NaN
5    NaN
6    NaN
7   -5.0
dtype: float64

In [0]:
(s
    .mul(s.cumsum())
    .diff()
    .where(lambda x: x < 0)
    .ffill()
)

0    NaN
1    NaN
2    NaN
3   -2.0
4   -2.0
5   -2.0
6   -2.0
7   -5.0
dtype: float64

In [0]:
(s
    .mul(s.cumsum())
    .diff()
    .where(lambda x: x < 0)
    .ffill()
    .add(s.cumsum(), fill_value=0)
)

0    0.0
1    1.0
2    2.0
3    0.0
4    1.0
5    2.0
6    3.0
7    0.0
dtype: float64

In [0]:
flights = pd.read_csv('data/flights.csv')
(flights
    .assign(ON_TIME=flights['ARR_DELAY'].lt(15).astype(int))
    [['AIRLINE', 'ORG_AIR', 'ON_TIME']]
)

      AIRLINE ORG_AIR  ON_TIME
0          WN     LAX        0
1          UA     DEN        1
2          MQ     DFW        0
3          AA     DFW        1
4          WN     LAX        0
...       ...     ...      ...
58487      AA     SFO        1
58488      F9     LAS        1
58489      OO     SFO        1
58490      WN     MSP        0
58491      OO     SFO        1

[58492 rows x 3 columns]

In [0]:
def max_streak(s):
    s1 = s.cumsum()
    return (s
       .mul(s1)
       .diff()
       .where(lambda x: x < 0) 
       .ffill()
       .add(s1, fill_value=0)
       .max()
    )

In [0]:
(flights
    .assign(ON_TIME=flights['ARR_DELAY'].lt(15).astype(int))
    .sort_values(['MONTH', 'DAY', 'SCHED_DEP']) 
    .groupby(['AIRLINE', 'ORG_AIR'])
    ['ON_TIME'] 
    .agg(['mean', 'size', max_streak])
    .round(2)
)

                 mean  size  max_streak
AIRLINE ORG_AIR
AA      ATL      0.82   233          15
        DEN      0.74   219          17
        DFW      0.78  4006          64
        IAH      0.80   196          24
        LAS      0.79   374          29
...               ...   ...         ...
WN      LAS      0.77  2031          39
        LAX      0.70  1135          23
        MSP      0.84   237          32
        PHX      0.77  1724          33
        SFO      0.76   445          17

[114 rows x 3 columns]

### How it works...

### There's more...

In [0]:
def max_delay_streak(df):
    df = df.reset_index(drop=True)
    late = 1 - df['ON_TIME']
    late_sum = late.cumsum()
    streak = (late
        .mul(late_sum)
        .diff()
        .where(lambda x: x < 0) 
        .ffill()
        .add(late_sum, fill_value=0)
    )
    last_idx = streak.idxmax()
    first_idx = last_idx - streak.max() + 1
    res = (df
        .loc[[first_idx, last_idx], ['MONTH', 'DAY']]
        .assign(streak=streak.max())
    )
    res.index = ['first', 'last']
    return res

In [0]:
(flights
    .assign(ON_TIME=flights['ARR_DELAY'].lt(15).astype(int))
    .sort_values(['MONTH', 'DAY', 'SCHED_DEP']) 
    .groupby(['AIRLINE', 'ORG_AIR']) 
    .apply(max_delay_streak) 
    .sort_values('streak', ascending=False)
)

                       MONTH   DAY  streak
AIRLINE ORG_AIR
AA      DFW     first    2.0  26.0    38.0
                last     3.0   1.0    38.0
MQ      ORD     last     1.0  12.0    28.0
                first    1.0   6.0    28.0
        DFW     last     2.0  26.0    25.0
...                      ...   ...     ...
US      LAS     last     1.0   7.0     1.0
AS      ATL     first    5.0   4.0     1.0
OO      LAS     first    2.0   8.0     1.0
EV      PHX     last     8.0   1.0     0.0
                first    NaN   NaN     0.0

[228 rows x 3 columns]